// Написати розв’язок нижче описаного завдання (по одному рядку коду на кожний пункт)
// 1.Створіть змінну city.
// 2.Присвойте їй значення «Київ».
// 3.Змініть значення змінної city на «Львів».
// 4.Створіть змінну address і скопіюйте в неї значення змінної city.
// 5.Вивести значення змінної address з допомогою команди alert().
var city = 'Kyiv';
var city = 'Lviv';
console.log(city);
var adress = city;
console.log(adress, typeof adress);


//Потрібно створити змінну n і записати в неї будь-яке число. 
// Створити іншу змінну result, в яку потрібно записати результат n в степені 3. Результат вивести командою console.log().
var n = 3;
var result = n ** 3;
console.log(result);


//Потрібно написати програму, яка обчислить вартість покупки. 
// Людина купила 4 ручки по 5.25 грн і 6 олівців по 3.50 грн. 
// Командами JavaScript потрібно обрахувати загальну вартість і 
// вивести результат в document.write (для вартостей і кількостей товарів постворювати окремі змінні).
var pen = 5.25;
var pencil = 3.50;
var result = pen * 4 + pencil * 6;
document.write(result);
